README.md

# Table of Contents

1.  [2020 BIOS 611 - Intro to Data Science](#org00d4fa7)
    1.  [Course Information](#orged995ab)
    2.  [About your Instructor](#org5a52c90)
    3.  [Portfolio](#org445b704)
    4.  [Slack](#orgab5d01b)
    5.  [Course Schedule](#orgfa03ede)
        1.  [Hyflex](#org9ebe668)
        2.  [Course Schedule](#orga78f6a6)
    6.  [Projects](#orga6f3e4a)
        1.  [Feedback](#org1e78314)
        2.  [Project 1](#org02adeaa)
        3.  [Project 2](#org911b8d3)
        4.  [Project 3](#org4b5090d)
        5.  [Project Grading](#org26d1435)


<a id="org00d4fa7"></a>

# 2020 BIOS 611 - Intro to Data Science

Lecture Zoom Link: <https://uncsph.zoom.us/j/96603579699?pwd=Ny9RUHFrL2lNQUUxZEJ1UTNmVFQvdz09>
Lab Zoom: <https://uncsph.zoom.us/j/96708005184?pwd=SFNBQXpnVHNvNnZLMktxZjJsZkVsUT09>
You will need the passwords to join - this is distributed via the Slack channel.
You should have gotten an email invite to the slack before the course started.
Email me if you need help: toups@email.unc.edu


<a id="orged995ab"></a>

## Course Information

The goals of this course:

1.  Familiarity with Data Science Tools like R, Python, git, Make, Docker, etc
2.  Good Data Science Practices

We will be covering the entire data science project lifetime, from
data ingest, quality control, analysis and reporting. An emphasis will
be placed on effectively communicating correct results (even when they
are negative) and upon giving feedback to colleagues.

To do these tasks effectively we will also focus heavily on using Git,
Make and Docker.


<a id="org5a52c90"></a>

## About your Instructor

I have both academic and "real world" experience as a scientist,
software engineer, and data scientist.


<a id="org445b704"></a>

## Portfolio

By the end of the semester each student will have produced a
portfolio including:

1.  A complete analysis in R demonstrating data wrangling, modeling,
    visualization.
2.  An interactive Shiny Dashboard
3.  A hybrid analysis using R, Python, Make and Docker (or Julia).


<a id="orgab5d01b"></a>

## Slack

This year in particular it will be useful for our class to communicate
online using our [Slack Channel](https://bios611.slack.com).


<a id="orgfa03ede"></a>

## Course Schedule

Fall 2020 Classes are unfortunately weird because of Covid 19. Classes
will be held Monday and Wed from 5:20 pm to 6:35 pm. Recitation/lab
time will be Tuesdays from 3:00-4:00 pm.  Labs will be a chance to
work with me directly or virtually on material covered during lecture.


<a id="org9ebe668"></a>

### Hyflex

BIOS 611 will be [Hyflex](https://keepteaching.unc.edu/modes-of-teaching/) this semester. This means that we will be
holding course in person but also broadcasting them live (presumably
over Zoom). Maximum occupancy and social distancing requirements mean
that only some students will attend any given class, with others
tuning in over zoom and still others watching the recorded lectures at
a different time.


<a id="orga78f6a6"></a>

### Course Schedule

NB - this is the first time I've taught this course. We might deviate
from this syllabus.

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Day</th>
<th scope="col" class="org-left">Time</th>
<th scope="col" class="org-left">Class Type</th>
<th scope="col" class="org-left">Subject</th>
<th scope="col" class="org-left">Materials</th>
<th scope="col" class="org-left">HW</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">Aug 10 (Monday) 2020</td>
<td class="org-left">5:20-6:35 pm</td>
<td class="org-left">Lecture</td>
<td class="org-left">Intro and Demo</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Aug 11 (Tuesday) 2020</td>
<td class="org-left">3:00-4:00 pm</td>
<td class="org-left">Lab/Recitation</td>
<td class="org-left">Compute Resources</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Aug 12 (Wednesday) 2020</td>
<td class="org-left">5:20-6:35 pm</td>
<td class="org-left">Lecture</td>
<td class="org-left">Compute Resources & R 1</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Aug 17 (Monday) 2020</td>
<td class="org-left">5:20-6:35 pm</td>
<td class="org-left">Lecture</td>
<td class="org-left">Programming Languages via R (R 2) & Datasets</td>
<td class="org-left"><https://learnxinyminutes.com/docs/r/> <http://adv-r.had.co.nz/Environments.html> <http://adv-r.had.co.nz/Functions.html></td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Aug 18 (Tuesday) 2020</td>
<td class="org-left">3:00-4:00 pm</td>
<td class="org-left">Lab/Recitation</td>
<td class="org-left">Project 1 Setup</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Aug 19 (Wednesday) 2020</td>
<td class="org-left">5:20-6:35 pm</td>
<td class="org-left">Lecture</td>
<td class="org-left">Linux and Bash &#x2026;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Aug 24 (Monday) 2020</td>
<td class="org-left">5:20-6:35 pm</td>
<td class="org-left">Lecture</td>
<td class="org-left">Docker & Make & Party</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Aug 25 (Tuesday) 2020</td>
<td class="org-left">3:00-4:00 pm</td>
<td class="org-left">Lab/Recitation</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Aug 26 (Wednesday) 2020</td>
<td class="org-left">5:20-6:35 pm</td>
<td class="org-left">Lecture</td>
<td class="org-left">Git Concepts and Practices</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Aug 31 (Monday) 2020</td>
<td class="org-left">5:20-6:35 pm</td>
<td class="org-left">Lecture</td>
<td class="org-left">Putting it all Together</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Sep 01 (Tuesday) 2020</td>
<td class="org-left">3:00-4:00 pm</td>
<td class="org-left">Lab/Recitation</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Sep 02 (Wednesday) 2020</td>
<td class="org-left">5:20-6:35 pm</td>
<td class="org-left">Lecture</td>
<td class="org-left">ggplot</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Sep 07 (Monday) 2020</td>
<td class="org-left">5:20-6:35 pm</td>
<td class="org-left">~</td>
<td class="org-left">Labor Day</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Sep 08 (Tuesday) 2020</td>
<td class="org-left">3:00-4:00 pm</td>
<td class="org-left">Lab/Recitation</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Sep 09 (Wednesday) 2020</td>
<td class="org-left">5:20-6:35 pm</td>
<td class="org-left">Lecture</td>
<td class="org-left">Relational Data and Tidy Data</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Sep 14 (Monday) 2020</td>
<td class="org-left">5:20-6:35 pm</td>
<td class="org-left">Lecture</td>
<td class="org-left">Agile Data Science?</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Sep 15 (Tuesday) 2020</td>
<td class="org-left">3:00-4:00 pm</td>
<td class="org-left">Lab/Recitation</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Sep 16 (Wednesday) 2020</td>
<td class="org-left">5:20-6:35 pm</td>
<td class="org-left">Lecture</td>
<td class="org-left">Classification</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Sep 21 (Monday) 2020</td>
<td class="org-left">5:20-6:35 pm</td>
<td class="org-left">Lecture</td>
<td class="org-left">Parameter Fitting and Optim</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Sep 22 (Tuesday) 2020</td>
<td class="org-left">3:00-4:00 pm</td>
<td class="org-left">Lab/Recitation</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Sep 23 (Wednesday) 2020</td>
<td class="org-left">5:20-6:35 pm</td>
<td class="org-left">Lecture</td>
<td class="org-left">Model Val & Char</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Sep 28 (Monday) 2020</td>
<td class="org-left">5:20-6:35 pm</td>
<td class="org-left">Lecture</td>
<td class="org-left">The Dark Art of Clustering</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Sep 29 (Tuesday) 2020</td>
<td class="org-left">3:00-4:00 pm</td>
<td class="org-left">Lab/Recitation</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Sep 30 (Wednesday) 2020</td>
<td class="org-left">5:20-6:35 pm</td>
<td class="org-left">Lecture</td>
<td class="org-left">Best in Show: Gradient Boosting Machines</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Oct 05 (Monday) 2020</td>
<td class="org-left">5:20-6:35 pm</td>
<td class="org-left">Lecture</td>
<td class="org-left">GBMs in Practice</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Oct 06 (Tuesday) 2020</td>
<td class="org-left">3:00-4:00 pm</td>
<td class="org-left">Lab/Recitation</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Oct 07 (Wednesday) 2020</td>
<td class="org-left">5:20-6:35 pm</td>
<td class="org-left">Lecture</td>
<td class="org-left">Project Presentations</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Oct 12 (Monday) 2020</td>
<td class="org-left">5:20-6:35 pm</td>
<td class="org-left">Lecture</td>
<td class="org-left">Shiny Introduction</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Oct 13 (Tuesday) 2020</td>
<td class="org-left">3:00-4:00 pm</td>
<td class="org-left">Lab/Recitation</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Oct 14 (Wednesday) 2020</td>
<td class="org-left">5:20-6:35 pm</td>
<td class="org-left">Lecture</td>
<td class="org-left">Docker Recap and Shiny</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Oct 19 (Monday) 2020</td>
<td class="org-left">5:20-6:35 pm</td>
<td class="org-left">Lecture</td>
<td class="org-left">Programming Languages and Python</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Oct 20 (Tuesday) 2020</td>
<td class="org-left">3:00-4:00 pm</td>
<td class="org-left">Lab/Recitation</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Oct 21 (Wednesday) 2020</td>
<td class="org-left">5:20-6:35 pm</td>
<td class="org-left">Lecture</td>
<td class="org-left">Pandas, Dplyr, SQL 1</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Oct 26 (Monday) 2020</td>
<td class="org-left">5:20-6:35 pm</td>
<td class="org-left">Lecture</td>
<td class="org-left">Pandas, Dplyr, SQL 2</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Oct 27 (Tuesday) 2020</td>
<td class="org-left">3:00-4:00 pm</td>
<td class="org-left">Lab/Recitation</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Oct 28 (Wednesday) 2020</td>
<td class="org-left">5:20-6:35 pm</td>
<td class="org-left">Lecture</td>
<td class="org-left">Scikit Learn</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Nov 02 (Monday) 2020</td>
<td class="org-left">5:20-6:35 pm</td>
<td class="org-left">Lecture</td>
<td class="org-left">A Taste of Neural Networks</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Nov 03 (Tuesday) 2020</td>
<td class="org-left">3:00-4:00 pm</td>
<td class="org-left">Lab/Recitation</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Nov 04 (Wednesday) 2020</td>
<td class="org-left">5:20-6:35 pm</td>
<td class="org-left">Lecture</td>
<td class="org-left">Regular Expressions</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Nov 09 (Monday) 2020</td>
<td class="org-left">5:20-6:35 pm</td>
<td class="org-left">Lecture</td>
<td class="org-left">Data Science Ethics</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Nov 10 (Tuesday) 2020</td>
<td class="org-left">3:00-4:00 pm</td>
<td class="org-left">Lab/Recitation</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Nov 11 (Wednesday) 2020</td>
<td class="org-left">5:20-6:35 pm</td>
<td class="org-left">Lecture</td>
<td class="org-left">Virtual Panel w/ Datascientists</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Nov 16 (Monday) 2020</td>
<td class="org-left">5:20-6:35 pm</td>
<td class="org-left">Lecture</td>
<td class="org-left">Presentations</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Nov 17 (Tuesday) 2020</td>
<td class="org-left">3:00-4:00 pm</td>
<td class="org-left">Lab/Recitation</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>


<a id="orga6f3e4a"></a>

## Projects

Grades will be based primarily on projects with the following steps:

1.  Students will submit an initial proposal “README” file describing the project
2.  Students will work individually to produce a first draft and submit it on Github
3.  Each student will review a handful of project drafts and provide thoughtful feedback
4.  Students will rate the quality of the feedback received from their peers
5.  Students will submit a final project draft
6.  Graders will review the project for high level organization and readability
7.  Students will give a short presentation about their project (only projects 1 and 3)

The grade will be based on the 1) quality of feedback provided to
peers, 2) the grader’s review, and 3) the presentation.


<a id="org1e78314"></a>

### Feedback

Students will give feedback on other student's projects which will be
graded.  Feedback should be succinct, relevant and actionable.  It should cover:

1.  Does the project use tidyverse functions to keep code succinct, efficient and readable? Where could a tidyverse function be added to improve the code?
2.  Are the plots appropriate for the data types, the hypotheses being tested, and the points being communicated?
3.  How can the code be organized or documented more clearly?
4.  Is the purpose of the project communicated clearly?
5.  Is the source of the data made clear?
6.  Is the interpretation of figures clearly explained?
7.  Is the purpose and interpretation of analysis steps clearly communicated?
8.  Are overall take-home messages clearly communicated?

The nature of data science is that our results are often uninteresting
and/or negative. This is not a problem with a project or
presentation. If anything, communicating negative results is even more
important, in practice, than communicating positive ones.


<a id="org02adeaa"></a>

### Project 1

A “complete” analysis in R, demonstrating data wrangling, modeling, visualization and delivery using R markdown.


<a id="org911b8d3"></a>

### Project 2

An interactive dashboard built with Shiny.


<a id="org4b5090d"></a>

### Project 3

A polyglot analysis using R, Python, Make and Docker.


<a id="org26d1435"></a>

### Project Grading

Projects will be graded on the following:

1.  A project should be easily runnable by anyone who
    checks out the git repository who has Docker installed.
2.  Git commits should be small and cover single changes to the code
    base after the initial phase of the project.
3.  The git repository shouldn't contain non-code artifacts. All
    results should be buildable from code and source data alone.
4.  The code should be organized and easy to understand at a high
    level.
5.  For project (1) the final result should be a PDF file generated via
    Latex or RMarkdown that summarizes the results. For project 2 the
    result is a shiny application.

